<?php
ini_set("display_errors", "On"); 
error_reporting(E_ALL & ~E_NOTICE);
// include_once 'sms/sms_function_manually.php';
include_once 'sms_function.php';
include_once '../openadodb.php' ;
$sms = new SMS_Gateway();
@session_start();


$tmp = $sms->send('99986006019798' , '301', '252', 'income', '580357', 'n', 0);
// $tmp = $sms->send('99986006029636' , '148', '456', '點交(結案)', '285816', 'n', 221537);
// $tmp = $sms->send('99986006049412' , '790', '2116', '點交(結案)', '287263', 'n', 384000);
// $tmp = $sms->send('60001060402451' , '123', '442', '點交(結案)', '280068', 'n', 798600);
// 
// $tmp = $sms->send('60001040230674' , '145', '467', 'cheque', '14671', 'n', 0);
// $tmp = $sms->send('60001010315621' , '2', '49', 'cheque', '13', 'n', 0);
// $tmp = $sms->send('60001010315621' , '2', '49', '扣繳稅款', '13', 'n', 0);
// $tmp = $sms->send('99985004025066' , '476', '440', '點交(結案)', '184336', 'n', 100000);//不要改資料(有仲介費的)
// $tmp = $sms->send('99985003077397' , '148', '460', '點交(結案)', '286590', 'n', 0);//不要改資料(沒有仲介費的)
// $tmp = $sms->send('60001010315621' , '2', '49', '解除契約', '13', 'n', 0);
//$tmp = $sms->send('60001050156651' , '273', '543', '預售屋', '562281', 'n', 0);
// $tmp = $sms->send('60001010315621' , '2', '49', '仲介服務費', '13', 'n', 0);
// $tmp = $sms->send('60001010315621' , '2', '49', '代清償', '13', 'n', 0);
// $tmp = $sms->send('99985002047215' , '6', '51', '扣繳稅款', '79227', 'n', 0);
// $tmp = $sms->send('99985002047215' , '6', '51', '賣方先動撥', '79236', 'n', 0);

 // $tmp = $sms->send('99986006058604' , '720', '1489', '代清償', '256466', 'n', 0);


// $tmp = $sms->send('99985004025066' , '476', '440', '點交(結案)', '184336', 'n', 100000);//地政士
// $tmp = $sms->send('99986006053996' , '298', '1038', '扣繳稅款', '258530', 'n', 0);//地政士
// $tmp = $sms->send('99985004042269' , '14', '74', '解除契約', '183889', 'n', 0); //買方
// $tmp = $sms->send('99985004025962' , '148', '453', '仲介服務費', '0', 'n', 0); //仲介

// $tmp = $sms->send('60001040185591' , '206', '304', '點交(結案)', '185197', 'n', 0); //仲介

//自訂簡訊發送對象
// $tmp = $sms->send2('60001050156651','預售屋',562281,'5ffd35d3dbb08','n','','') ;

echo "<pre>";
 print_r($tmp);
echo "</pre>";



//$sms->send('14碼保證號碼' , '地政士id', '仲介店id', 'cheque', 'tExpense_cheque id', 'n', 0);
?>
