<?php
//合約書規格定義
$contractSetting = [
    'brand'       => [
        '1'  => '台灣房屋',
        '2'  => '第一建經(非仲介成交)',
        '49' => '優美地產',
        '69' => '幸福家不動產',
        '72' => '群義房屋',
        '75' => '飛鷹地產',
        '80' => '實易不動產',
    ],
    'category'    => [
        '1' => '台屋加盟',
        '2' => '台屋直營',
        '3' => '第一建經',
    ],
    'appilcation' => [
        '1' => '土地',
        '2' => '建物',
        '3' => '預售屋',
    ],
    'process'     => [
        '1' => '已接收',
        '2' => '製作中',
        '3' => '已出貨',
        '4' => '代書撤銷',
        '5' => '經辦撤銷',
        '6' => '製作中(已部分出貨)',
    ],
];
